Documents/УслугиСобственнымПодразделениям.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Document>
		<Properties>
			<Name>УслугиСобственнымПодразделениям</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.УчетЗатрат</xr:Item>
				<xr:Item>AccountingRegister.Хозрасчетный</xr:Item>
				<xr:Item>InformationRegister.ДокументыТребующиеДопроведения</xr:Item>
				<xr:Item>AccumulationRegister.УчетЗатратРегл</xr:Item>
				<xr:Item>AccumulationRegister.ЗатратыНаСтроительствоОбъектовОсновныхСредств</xr:Item>
				<xr:Item>AccumulationRegister.СтроительствоОбъектовОсновныхСредств</xr:Item>
				<xr:Item>AccountingRegister.Налоговый</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоменклатурнаяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатурныеГруппы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтражатьВУправленческомУчете</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтражатьВБухгалтерскомУчете</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтражатьВНалоговомУчете</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетЗатрат</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетЗатратНУ</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Налоговый</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Затраты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПодразделениеПолучатель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПодразделениеОрганизацииПолучатель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяЗатрат</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиЗатрат</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НоменклатурнаяГруппа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НоменклатурныеГруппы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Счет</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетНУ</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Налоговый</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Продукция</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СерияПродукции</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаПродукции</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Заказ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Проект</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/УслугиСобственнымПодразделениям/Ext/ManagerModule.bsl
// Функция формирования печатной формы документа "УслугиСобственнымПодразделениям"
//
Функция ПечатьУслугиСобственнымПодразделениям(МассивОбъектов, ОбъектыПечати)
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_УслугиСобственнымПодразделениям_УслугиСобственнымПодразделениям";
	
	Макет  = ПолучитьМакет("УслугиСобственнымПодразделениям");
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	УслугиСобственнымПодразделениям.Ссылка,
	|	УслугиСобственнымПодразделениям.Представление,
	|	УслугиСобственнымПодразделениям.Организация,
	|	УслугиСобственнымПодразделениям.Организация.Представление КАК ПечОрганизация,
	|	УслугиСобственнымПодразделениям.Номенклатура.Представление КАК ПечУслуга,
	|	ВЫБОР
	|		КОГДА &ТипУчета = ""Упр""
	|			ТОГДА УслугиСобственнымПодразделениям.Подразделение
	|		ИНАЧЕ УслугиСобственнымПодразделениям.ПодразделениеОрганизации
	|	КОНЕЦ КАК Подразделение,
	|	ВЫБОР
	|		КОГДА &ТипУчета = ""Упр""
	|			ТОГДА ПРЕДСТАВЛЕНИЕ(УслугиСобственнымПодразделениям.Подразделение)
	|		ИНАЧЕ ПРЕДСТАВЛЕНИЕ(УслугиСобственнымПодразделениям.ПодразделениеОрганизации)
	|	КОНЕЦ КАК ПечПодразделение,
	|	УслугиСобственнымПодразделениям.НоменклатурнаяГруппа КАК НомГруппа,
	|	ПРЕДСТАВЛЕНИЕ(УслугиСобственнымПодразделениям.НоменклатурнаяГруппа) КАК ПечНомГруппа,
	|	ПРЕДСТАВЛЕНИЕ(УслугиСобственнымПодразделениям.Номенклатура.БазоваяЕдиницаИзмерения) КАК ЕдиницаИзмерения,
	|	УслугиСобственнымПодразделениям.Затраты.(
	|		НомерСтроки КАК НомерСтроки,
	|		ВЫБОР
	|			КОГДА &ТипУчета = ""Упр""
	|				ТОГДА УслугиСобственнымПодразделениям.Затраты.ПодразделениеПолучатель
	|			ИНАЧЕ УслугиСобственнымПодразделениям.Затраты.ПодразделениеОрганизацииПолучатель
	|		КОНЕЦ КАК ПодразделениеПолучатель,
	|		ВЫБОР
	|			КОГДА &ТипУчета = ""Упр""
	|				ТОГДА ПРЕДСТАВЛЕНИЕ(УслугиСобственнымПодразделениям.Затраты.ПодразделениеПолучатель)
	|			ИНАЧЕ ПРЕДСТАВЛЕНИЕ(УслугиСобственнымПодразделениям.Затраты.ПодразделениеОрганизацииПолучатель)
	|		КОНЕЦ КАК ПечПодразделениеПолучатель,
	|		Количество КАК ПечКоличество
	|	)
	|ИЗ
	|	Документ.УслугиСобственнымПодразделениям КАК УслугиСобственнымПодразделениям
	|ГДЕ
	|	УслугиСобственнымПодразделениям.Ссылка = &ТекДок
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	ПервыйДокумент = Истина;
	
	Для Каждого Ссылка Из МассивОбъектов Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабДок.ВысотаТаблицы + 1;
		
		Запрос = Новый Запрос;
		Запрос.Текст = ТекстЗапроса;
	
		ТипУчета = ?(Ссылка.ОтражатьВУправленческомУчете, "Упр","Бух");
		Запрос.УстановитьПараметр("ТекДок",   Ссылка);
		Запрос.УстановитьПараметр("ТипУчета", ТипУчета);
	
		РезультатЗапроса = Запрос.Выполнить();
		Шапка = РезультатЗапроса.Выбрать();
		Шапка.Следующий();
		
		// Вывод заголовка
		Область = Макет.ПолучитьОбласть("Заголовок");
		Область.Параметры.Заполнить(Шапка);
		Область.Параметры.Заголовок 				= ОбщегоНазначения.СформироватьЗаголовокДокумента(Ссылка.ПолучитьОбъект());
		ТабДок.Вывести(Область);
		
		Область 		= Макет.ПолучитьОбласть("Шапка");
		ТабДок.Вывести(Область);
		Область 		= Макет.ПолучитьОбласть("Строка");
		ТабЧасть 		= Шапка.Затраты.Выбрать();
		КоличествоИтого = 0;
		
		Пока ТабЧасть.Следующий() Цикл
			
			Область.Параметры.Заполнить(ТабЧасть);
			Область.Параметры.ПечНомер = ТабЧасть.НомерСтроки;
			
			ТабДок.Вывести(Область);
			КоличествоИтого = КоличествоИтого + ТабЧасть.ПечКоличество;
			
		КонецЦикла;
		
		Область = Макет.ПолучитьОбласть("Подвал");
		Область.Параметры.ПечКоличество    = КоличествоИтого;
		Область.Параметры.ЕдиницаИзмерения = ?(ЗначениеЗаполнено(Шапка.ЕдиницаИзмерения),", "+Шапка.ЕдиницаИзмерения,"");
		ТабДок.Вывести(Область);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДок, НомерСтрокиНачало, ОбъектыПечати, Ссылка);
		
	КонецЦикла; 
	
	Возврат ТабДок;
	
КонецФункции // ПечатьУслугиСобственнымПодразделениям()
	
// Сформировать печатные формы объектов
//
// ВХОДЯЩИЕ:
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать
//
// ИСХОДЯЩИЕ:
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы
//   ОшибкиПечати          - Список значений  - Ошибки печати  (значение - ссылка на объект, представление - текст ошибки)
//   ОбъектыПечати         - Список значений  - Объекты печати (значение - ссылка на объект, представление - имя области в которой был выведен объект)
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	ПараметрыВывода.ДоступнаПечатьПоКомплектно = Истина;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "УслугиСобственнымПодразделениям") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "УслугиСобственнымПодразделениям", "Услуги собственным подразделениям", ПечатьУслугиСобственнымПодразделениям(МассивОбъектов, ОбъектыПечати));
	КонецЕсли;
	
КонецПроцедуры

// В функции описано, какие данные следует сохранять в шаблоне
Функция СтруктураДополнительныхДанныхФормы() Экспорт
	
	Возврат ХранилищаНастроек.ДанныеФорм.СформироватьСтруктуруДополнительныхДанных("Затраты");
	
КонецФункции


Функция ПараметрыУчетаНоменклатуры(ДанныеДляЗаполнения) Экспорт
	
	ЗначенияДляЗаполнения = Новый Структура();
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = "ВЫБРАТЬ
	|	&Номенклатура КАК Номенклатура,
	|	&ВидНоменклатуры КАК ВидНоменклатуры
	|ПОМЕСТИТЬ ДанныеНоменклатуры";
	
	Запрос.УстановитьПараметр("Номенклатура",    ДанныеДляЗаполнения.Номенклатура);
	Запрос.УстановитьПараметр("ВидНоменклатуры", ДанныеДляЗаполнения.Номенклатура.ВидНоменклатуры);
	Запрос.Выполнить();
	
	СчетаУчетаВДокументах.СформироватьТаблицуПараметровУчетаУслуг(Запрос.МенеджерВременныхТаблиц, ДанныеДляЗаполнения.Организация, 	ДанныеДляЗаполнения.Дата);
	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеНоменклатуры.Номенклатура,
	|	ДанныеНастроекПараметровУчета.Подразделение 				КАК Подразделение,
	|	ДанныеНастроекПараметровУчета.ПодразделениеОрганизации 		КАК ПодразделениеОрганизации,
	|	ДанныеНастроекПараметровУчета.НоменклатурнаяГруппа 			КАК НоменклатурнаяГруппа,
	|	ДанныеНастроекПараметровУчета.СчетЗатрат 					КАК СчетЗатрат,
	|	ДанныеНастроекПараметровУчета.СчетЗатратНУ 					КАК СчетЗатратНУ
	|ИЗ ДанныеНоменклатуры
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	ДанныеНастроекПараметровУчета КАК ДанныеНастроекПараметровУчета
	|ПО ДанныеНастроекПараметровУчета.Номенклатура = ДанныеНоменклатуры.Номенклатура
	|";
	Выборка = Запрос.Выполнить().Выбрать();
	
	//Выборка всегда будет содержать хотя бы одну запись
	Выборка.Следующий();
	
	Если НЕ ЗначениеЗаполнено(Выборка.Подразделение) Тогда
		// Параметры не заданы
	Иначе
		
		ЗначенияДляЗаполнения.Вставить("Подразделение");
		ЗначенияДляЗаполнения.Вставить("ПодразделениеОрганизации");
		ЗначенияДляЗаполнения.Вставить("НоменклатурнаяГруппа");
		ЗначенияДляЗаполнения.Вставить("СчетЗатрат");
		ЗначенияДляЗаполнения.Вставить("СчетЗатратНУ");
		ЗаполнитьЗначенияСвойств(ЗначенияДляЗаполнения, Выборка);
		
	КонецЕсли;
	
	Возврат ЗначенияДляЗаполнения;
	
КонецФункции
